# Chapter 5: Getting Started with Pandas

In [21]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

## 5.1: Introduction to pandas Data Structures

### Series

In [22]:
obj=Series([4,7,-5,3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [23]:
obj1=Series([4,6,"a",1])
obj1

0    4
1    6
2    a
3    1
dtype: object

In [24]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [25]:
obj=pd.Series([4,7,5,-3])
obj

0    4
1    7
2    5
3   -3
dtype: int64

In [26]:
obj.array

<NumpyExtensionArray>
[4, 7, 5, -3]
Length: 4, dtype: int64

In [27]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [28]:
obj2=Series([4,7,-5,3],index=["d","b","a","c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [29]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [30]:
obj2["a"]

-5

In [31]:
obj2["d"]=6

In [32]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [33]:
obj2[["c","a","d"]]

c    3
a   -5
d    6
dtype: int64

In [34]:
obj2[[3,2,1]]

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_7596\3951335562.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[3,2,1]]

c    3
a   -5
b    7
dtype: int64

In [35]:
obj2.iloc[[3,2,1]]

c    3
a   -5
b    7
dtype: int64

In [36]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [37]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [38]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [39]:
"b" in obj2

True

In [40]:
"e" in obj2

False

In [41]:
sdata={"Ohio":35000,"Texas":71000,"Oregon":16000,"Utah":5000}

In [42]:
sdata

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [43]:
obj3=Series(sdata)

In [44]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [45]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [46]:
states=["California","Ohio","Oregon","Texas"]
obj4=Series(sdata,index=states)
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [47]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [48]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [49]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [50]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [51]:
obj3
obj4

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [52]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [53]:
obj4.name

In [54]:
obj4.name="population"
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [55]:
obj4.index

Index(['California', 'Ohio', 'Oregon', 'Texas'], dtype='object')

In [56]:
obj4.index.name="state"

In [57]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [58]:
obj

0    4
1    7
2    5
3   -3
dtype: int64

In [59]:
obj.index=["Bob","Steve","Jeff","Ryan"]
obj

Bob      4
Steve    7
Jeff     5
Ryan    -3
dtype: int64

### DataFrame

In [60]:
data={"state":["Ohio","Ohio","Ohio","Nevada","Nevada","Nevada"],
      "year":[200,2001,2002,2001,2002,2003],
      "pop":[1.5,1.7,3.6,2.4,2.9,3.2]}
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [200, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [61]:
frame=DataFrame(data)
frame

    state  year  pop
0    Ohio   200  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [62]:
frame.head()

    state  year  pop
0    Ohio   200  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [63]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [64]:
DataFrame(data,columns=["year","state","pop"])

   year   state  pop
0   200    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [65]:
frame2=pd.DataFrame(data,columns=["year","state","pop","debt"])
frame2

   year   state  pop debt
0   200    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [66]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [67]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [68]:
frame2.year

0     200
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [69]:
frame2["year"][0]=2000

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_7596\2766672876.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  frame2["year"][0]=2000

In [70]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [71]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [72]:
frame2.iloc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [73]:
frame2["debt"]=16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [74]:
frame2["debt"]=np.arange(6.)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [75]:
val=Series([-1.2,-1.5,-1.7],index=[2,4,5])
frame2["debt"]=val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [76]:
frame2["eastern"]=frame2["state"]=="Ohio"

In [77]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6  -1.2     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9  -1.5    False
5  2003  Nevada  3.2  -1.7    False

In [78]:
del frame2["eastern"]

In [79]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [80]:
populations={"Ohio":{2000:1.5,2001:1.7,2002:3.6},
             "Nevada":{2001:2.4,2002:2.9}}

In [81]:
frame3=DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [82]:
frame3.index

Index([2000, 2001, 2002], dtype='int64')

In [83]:
frame3.index.name="Year"

In [84]:
frame3

      Ohio  Nevada
Year
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [85]:
frame3.T

Year    2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [86]:
DataFrame(populations,index=[2001,2002,2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [87]:
frame3["Ohio"][:-1]

Year
2000    1.5
2001    1.7
Name: Ohio, dtype: float64

In [88]:
pdata={"Ohio":frame3["Ohio"][:-1],
       "Nevada":frame3["Nevada"][:2]}
DataFrame(pdata)

      Ohio  Nevada
Year
2000   1.5     NaN
2001   1.7     2.4

In [89]:
frame3.index.name

'Year'

In [90]:
frame3.columns.name="state"

In [91]:
frame3

state  Ohio  Nevada
Year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [92]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [93]:
frame3.to_json()

'{"Ohio":{"2000":1.5,"2001":1.7,"2002":3.6},"Nevada":{"2000":null,"2001":2.4,"2002":2.9}}'

In [94]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6  -1.2
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9  -1.5
5  2003  Nevada  3.2  -1.7

In [95]:
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, -1.2],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, -1.5],
       [2003, 'Nevada', 3.2, -1.7]], dtype=object)

### Index Objects

In [96]:
obj=Series(np.arange(3))

In [97]:
obj

0    0
1    1
2    2
dtype: int32

In [98]:
obj.index

RangeIndex(start=0, stop=3, step=1)

In [99]:
obj=Series(np.arange(3),index=["a","b","c"])

In [100]:
obj

a    0
b    1
c    2
dtype: int32

In [101]:
obj.index

Index(['a', 'b', 'c'], dtype='object')

In [102]:
index=obj.index
index[1:]

Index(['b', 'c'], dtype='object')

In [103]:
index[1]="d"

TypeError: Index does not support mutable operations

In [ ]:
labels=pd.Index(np.arange(3))
labels

Index([0, 1, 2], dtype='int32')

In [ ]:
obj2=Series([1.5,-2.5,0],index=labels)
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [ ]:
obj2.index

Index([0, 1, 2], dtype='int32')

In [ ]:
obj2.index is labels

True

In [104]:
frame3

state  Ohio  Nevada
Year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [105]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [106]:
"Ohio" in frame3.columns

True

In [107]:
frame3.index

Index([2000, 2001, 2002], dtype='int64', name='Year')

In [108]:
2003 in frame3.index

False

In [109]:
pd.Index(["foo","foo","bar","bar","bar"])

Index(['foo', 'foo', 'bar', 'bar', 'bar'], dtype='object')

In [110]:
objx=Series(np.arange(5))
objx

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [111]:
objx.index=pd.Index(["foo","foo","bar","bar","bar"])

In [112]:
objx

foo    0
foo    1
bar    2
bar    3
bar    4
dtype: int32

## 5.2: Essential Functionality

### Reindexing

In [113]:
obj=Series([4.5,7.2,-5.3,3.6],index=["d","b","a","c"])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [114]:
obj2=obj.reindex(["a","b","c","d","e"])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [115]:
obj3=pd.Series(["blue","purple","yellow"],index=[0,2,4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [116]:
obj3.reindex(np.arange(6),method="ffill")

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [120]:
frame=DataFrame(np.arange(9).reshape((3,3)),
                index=["a","c","d"],
                columns=["Ohio","Texas","California"])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [121]:
frame2=frame.reindex(index=["a","b","c","d"])

In [122]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [123]:
states=["Texas","Utah","California"]
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [124]:
frame.reindex(states,axis="columns")

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [126]:
frame.loc[["a","d","c"],["California","Texas"]]

   California  Texas
a           2      1
d           8      7
c           5      4

In [127]:
frame.loc[["California","Texas"],["a","d","c"]]

KeyError: "None of [Index(['California', 'Texas'], dtype='object')] are in the [index]"

In [129]:
frame.loc[["a"]]

   Ohio  Texas  California
a     0      1           2

### Dropping Entries from an Axis

In [130]:
obj=Series(np.arange(5),index=["a","b","c","d","e"])
obj

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [131]:
new_obj=obj.drop("c")
new_obj

a    0
b    1
d    3
e    4
dtype: int32

In [132]:
obj.drop(["d","c"])

a    0
b    1
e    4
dtype: int32

In [133]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),
                  index=["Ohio","Colorado","Utah","New York"],
                  columns=["one","two","three","four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [134]:
data.drop(index=["Colorado","Ohio"])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [135]:
data.drop(columns="two")

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [136]:
data.drop("two",axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [138]:
data.drop(["two","four"],axis="columns")

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [140]:
data.drop(["two","four"],axis=0)

KeyError: "['two', 'four'] not found in axis"

### Indexing, Selection, and Filtering

In [141]:
obj=Series(np.arange(4),index=["a","b","c","d"])
obj

a    0
b    1
c    2
d    3
dtype: int32

In [142]:
obj["b"]

1

In [143]:
obj[1]

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_7596\2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

1

In [144]:
obj[2:4]

c    2
d    3
dtype: int32

In [145]:
obj[2:3]

c    2
dtype: int32

In [146]:
obj[["b","a","d"]]

b    1
a    0
d    3
dtype: int32

In [147]:
obj[[1,3]]

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_7596\1781339481.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1,3]]

b    1
d    3
dtype: int32

In [148]:
obj[obj<2]

a    0
b    1
dtype: int32

In [149]:
obj.loc[["b","a","d"]]

b    1
a    0
d    3
dtype: int32

In [150]:
obj1=Series([1,2,3],index=[2,0,1])
obj2=Series([1,2,3],index=["a","b","c"])
obj1
obj2

2    1
0    2
1    3
dtype: int64

a    1
b    2
c    3
dtype: int64

In [151]:
obj1[[0,1,2]]

0    2
1    3
2    1
dtype: int64

In [152]:
obj2[[0,1,2]]

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_7596\2179584337.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj2[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [153]:
obj2.loc[[0,1,2]]

KeyError: "None of [Index([0, 1, 2], dtype='int32')] are in the [index]"

In [154]:
obj1.iloc[[0,1,2]]

2    1
0    2
1    3
dtype: int64

In [155]:
obj2.iloc[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [156]:
obj2.loc["b":"c"]

b    2
c    3
dtype: int64

In [157]:
obj2

a    1
b    2
c    3
dtype: int64

In [158]:
obj2["b":"c"]=5
obj2

a    1
b    5
c    5
dtype: int64

In [159]:
data=DataFrame(np.arange(16).reshape((4,4)),
               index=["Ohio","Colorado","Utah","New York"],
               columns=["one","two","three","four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [160]:
data["two"]

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [161]:
data[["two"]]

          two
Ohio        1
Colorado    5
Utah        9
New York   13

In [162]:
data[["three","one"]]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [163]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [164]:
data[data["three"]>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [165]:
data<5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [166]:
data[data<5]=0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Selection on DataFrame with loc and iloc

In [167]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [168]:
data.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int32

In [169]:
data.loc[["Colorado","New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [170]:
data.loc["Colorado",["two","three"]]

two      5
three    6
Name: Colorado, dtype: int32

In [173]:
data.loc[["Colorado"],["two","three"]]

          two  three
Colorado    5      6

In [179]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [174]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [175]:
data.iloc[[2,1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [180]:
data.iloc[[1],[1,2]]

          two  three
Colorado    5      6

In [181]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [182]:
data.iloc[[2],[3,0,1]]

      four  one  two
Utah    11    8    9

In [183]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [184]:
data.loc[:"Utah","two"]

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [187]:
data.loc[:"Utah",["two"]]

          two
Ohio        0
Colorado    5
Utah        9

In [192]:
data.iloc[:,:3][data.three>5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [194]:
data.loc[data.three>=2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [196]:
data[data.three>=2]

          one  two  three  four
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

#### Integer Indexing pitfalls

In [197]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [198]:
ser[-1]

KeyError: -1

In [199]:
ser2=Series(np.arange(3),index=["a","b","c"])
ser2

a    0
b    1
c    2
dtype: int32

In [200]:
ser2[-1]

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_7596\811950851.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser2[-1]

2

In [201]:
ser.iloc[-1]

2.0

In [203]:
ser2.iloc[-1]

2

In [204]:
ser.loc[-1]

KeyError: -1

In [205]:
ser2.loc[-1]

KeyError: -1

In [206]:
ser[:2]

0    0.0
1    1.0
dtype: float64

#### Pitfalls with chained indexing

In [207]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [208]:
data.loc[:,"one"]

Ohio         0
Colorado     0
Utah         8
New York    12
Name: one, dtype: int32

In [209]:
data.loc[:, "one"] = 1
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [210]:
data.iloc[2]

one       1
two       9
three    10
four     11
Name: Utah, dtype: int32

In [211]:
data.iloc[2]=5
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    1    5      6     7
Utah        5    5      5     5
New York    1   13     14    15

In [212]:
data.loc[data["four"]>5]=3
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [214]:
data["four"]>5

Ohio        False
Colorado    False
Utah        False
New York    False
Name: four, dtype: bool

In [217]:
data.loc[data.three==5]["three"]=6

C:\Users\Karim.Badr\AppData\Local\Temp\ipykernel_7596\3936912511.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data.loc[data.three==5]["three"]=6

In [218]:
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      5     5
New York    3    3      3     3

In [219]:
data.loc[data.three==5,"three"]=6
data

          one  two  three  four
Ohio        1    0      0     0
Colorado    3    3      3     3
Utah        5    5      6     5
New York    3    3      3     3

### Arithmetic and Data Alignment

In [220]:
s1=Series([7.3,-2.5,3.4,1.5],index=["a","c","d","e"])
s2=Series([-2.1,3.6,-1.5,4,3.1],index=["a","c","e","f","g"])
s1
s2

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [221]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [222]:
df1=DataFrame(np.arange(9).reshape((3,3)),
              columns=list("bcd"),
              index=["Ohio","Texas","Colorado"])

df2=DataFrame(np.arange(12).reshape((4,3)),
              columns=list("bde"),
              index=["Utah","Ohio","Texas","Oregon"])

In [223]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [224]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [225]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN